IDENTIFICATION DIVISION.
PROGRAM-ID. PROG1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT EMPDATA ASSIGN TO EMPIN
    ORGANIZATION IS SEQUENTIAL.
  SELECT FILTROS ASSIGN TO FILIN
    ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
  FD EMPDATA
    RECORDING MODE IS F
    DATA RECORD IS EMPDATALINEA.
  01 EMPDATALINEA.
    05 ID-EMP     PIC X(4).
    05 NOM-EMP    PIC X(19).
    05 EDAD-EMP   PIC X(2).
    05 SEXO-EMP   PIC X(1).
    05 PUESTO-EMP PIC X(15).
    05 ANT-EMP    PIC X(3).
    05 REND-EMP   PIC X(3).
    05 FILLER     PIC X(33).
  FD FILTROS
    RECORDING MODE IS F
    DATA RECORD IS FILDATALINE.
  01 FILDATALINE.
    05 TIPO-FIL PIC X(1).
    05 COND-FIL PIC X(15).
    05 FILLER   PIC X(64).
WORKING-STORAGE SECTION.
  01 TABLA-EMP.
    05 LINEA-TABLA OCCURS 50 TIMES
                   INDEXED BY INDICE-TAB.
      10 ID-TAB     PIC X(4).
      10 NOM-TAB    PIC X(19).
      10 EDAD-TAB   PIC X(2).
      10 SEXO-TAB   PIC X(1).
      10 PUESTO-TAB PIC X(15).
      10 ANT-TAB    PIC X(3).
      10 REND-TAB   PIC X(3).
  01 SWITCH-FIN-ARCHIVO PIC X(1) VALUE 'N'.
    88 FIN-ARCHIVO VALUE 'Y'.
  01 SWITCH-FIN-FILTROS PIC X(1) VALUE 'N'.
    88 FIN-FILTROS VALUE 'Y'.
* VARAIBLE AUXILIAR PARA RECORRIDOS SECUENCIALES.
  77 I PIC 9(3) VALUE 0.
* CONTADOR: VARIABLE QUE ACUMULARA LOS CASOS FILTRADOS.
  77 CONTADOR PIC 9(3) VALUE 000.
* CANT-REG: ALMACENARA LA CANTIDAD DE REGISTROS VALIDOS.
  77 CANT-REG PIC 9(2) VALUE 000.
* COND-NUM: ALMACENARA LA CONDICION PARA COMPARACIONES NUMERICAS.
  77 COND-NUM PIC 9(3) VALUE 000.
PROCEDURE DIVISION.
* COMIENZA EJECUCION DEL PROGRAMA
MAIN-PROCEDURE.
    PERFORM CARGAR-TABLA.
    PERFORM MOSTRAR-TABLA.
    PERFORM APLICAR-FILTROS.
    STOP RUN.
LEER-LINEA.
  READ EMPDATA
    AT END
      MOVE 'Y' TO SWITCH-FIN-ARCHIVO.
  EXIT.
PROCESAR-LINEA.
  IF INDICE-TAB > 50 THEN
    EXIT PARAGRAPH
  END-IF.
  MOVE ID-EMP TO ID-TAB(INDICE-TAB).
  MOVE NOM-EMP TO NOM-TAB(INDICE-TAB).
  MOVE EDAD-EMP TO EDAD-TAB(INDICE-TAB).
  MOVE SEXO-EMP TO SEXO-TAB(INDICE-TAB).
  MOVE PUESTO-EMP TO PUESTO-TAB(INDICE-TAB).
  MOVE ANT-EMP TO ANT-TAB(INDICE-TAB).
  MOVE REND-EMP TO REND-TAB(INDICE-TAB).
  SET INDICE-TAB UP BY 1.
  ADD 1 TO CANT-REG.
  EXIT.
CARGAR-TABLA.
  MOVE 0 TO CANT-REG.
  MOVE 'N' TO SWITCH-FIN-ARCHIVO.
  OPEN INPUT EMPDATA.
  PERFORM LEER-LINEA.
  PERFORM UNTIL FIN-ARCHIVO
    PERFORM PROCESAR-LINEA
    PERFORM LEER-LINEA
  END-PERFORM.
  CLOSE EMPDATA.
  EXIT.
MOSTRAR-TABLA.
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > CANT-REG
	SET INDICE-TAB TO I
	DISPLAY "--REGISTRO " I "--"
	DISPLAY ID-TAB(INDICE-TAB)
	DISPLAY NOM-TAB(INDICE-TAB)
	DISPLAY EDAD-TAB(INDICE-TAB)
	DISPLAY SEXO-TAB(INDICE-TAB)
	DISPLAY PUESTO-TAB(INDICE-TAB)
	DISPLAY ANT-TAB(INDICE-TAB)
	DISPLAY REND-TAB(INDICE-TAB)
	DISPLAY "--Fin registro--"
  END-PERFORM.
  EXIT.
FILTRAR-SEXO.
  EVALUATE SEXO-TAB(INDICE-TAB)
    WHEN FUNCTION TRIM(COND-FIL)
      ADD 1 TO CONTADOR
  END-EVALUATE.
  IF INDICE-TAB = CANT-REG THEN
    DISPLAY CONTADOR " EMPLEADOS DE SEXO " COND-FIL
    MOVE 0 TO CONTADOR
  END-IF.
  EXIT.
FILTRAR-REND.
  COMPUTE COND-NUM = FUNCTION NUMVAL(COND-FIL(2:)).
  EVALUATE COND-FIL(1:1)
    WHEN '<'
      IF REND-TAB(INDICE-TAB) < COND-NUM THEN
        ADD 1 TO CONTADOR
      END-IF
    WHEN '>'
      IF REND-TAB(INDICE-TAB) > COND-NUM THEN
        ADD 1 TO CONTADOR
      END-IF
    WHEN '='
      IF REND-TAB(INDICE-TAB) = COND-NUM THEN
        ADD 1 TO CONTADOR
      END-IF
  END-EVALUATE.
  IF INDICE-TAB = CANT-REG THEN
    DISPLAY CONTADOR " EMPLEADOS CON RENDIMIENTO " COND-FIL
    MOVE 0 TO CONTADOR
    MOVE 0 TO COND-NUM
  END-IF.
  EXIT.
FILTRAR-PUESTO.
  IF PUESTO-TAB(INDICE-TAB) = 
-  FUNCTION TRIM(COND-FIL(2:)) THEN
    ADD 1 TO CONTADOR
  END-IF.
  IF INDICE-TAB = CANT-REG THEN
    DISPLAY CONTADOR " - " FUNCTION TRIM(COND-FIL(2:))
    MOVE 0 TO CONTADOR
  END-IF.
  EXIT.
BUSCAR-ID.
  SET INDICE-TAB TO 1.
  MOVE 0 TO CONTADOR.
  SEARCH LINEA-TABLA VARYING CONTADOR
    AT END
      DISPLAY CONTADOR ' - ID NO ENCONTRADO'
    WHEN ID-TAB(INDICE-TAB) = COND-FIL(2:)
-     AND INDICE-TAB <= CANT-REG
		DISPLAY '--CONSULTA ' ID-TAB(INDICE-TAB) '--'
        DISPLAY 'ID ENCONTRADO: ' ID-TAB(INDICE-TAB)
        DISPLAY 'EMPLEADO: ' NOM-TAB(INDICE-TAB)
        DISPLAY 'PUESTO: ' PUESTO-TAB(INDICE-TAB)
        DISPLAY 'RENDIMIENTO: ' REND-TAB(INDICE-TAB)
  END-SEARCH.
  EXIT.
APLICAR-FILTRO.
  READ FILTROS
    AT END
      DISPLAY '--- FINAL DE FILTROS ---'
      MOVE 'Y' TO SWITCH-FIN-FILTROS
    NOT AT END
	  EVALUATE TIPO-FIL
	    WHEN 'I'
		  PERFORM BUSCAR-ID
		WHEN OTHER
		  PERFORM VARYING I FROM 1 BY 1 UNTIL 1 > CANT-REG
		    SET INDICE-TAB TO I
			  EVALUATE TIPO-FIL
			    WHEN 'S'
                  PERFORM FILTRAR-SEXO
                WHEN 'R'
                  PERFORM FILTRAR-REND
                WHEN 'P'
                  PERFORM FILTRAR-PUESTO               
	          END-EVALUATE
		  END-PERFORM	
	  END-EVALUATE		  
  END-READ.
  EXIT.
APLICAR-FILTROS.
  MOVE 'N' TO SWITCH-FIN-FILTROS.
  OPEN INPUT FILTROS.
  DISPLAY '--- INICIO FILTROS ---'.
  PERFORM UNTIL FIN-FILTROS    
      PERFORM APLICAR-FILTRO
  END-PERFORM.
  CLOSE FILTROS.
  EXIT.
END PROGRAM PROG1.